Revit 2027 API
BuiltInFailures.DirectContext3DFailures Class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DirectContext3DFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class DirectContext3DFailures
Public NotInheritable Class DirectContext3DFailures
public ref class DirectContext3DFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DirectContext3DFailures = class end
The BuiltInFailures.DirectContext3DFailures type exposes the following members.
Properties
Name | Description
NoMoreExternalDataTypeInstances |  No more instances of the Coordination Model.
UnableToLoadCoordinationModel |  Unable to load Coordination Model.
Top
See Also
Reference
Autodesk.Revit.DB Namespace